package Task_3_4_theoretical_task;

public class AnswerToQuestion {

//    Дан метод:
//
//    private void process(Collection<Integer> firstCollection, List<Integer> list) {
//        if (firstCollection.containsAll(list)) {
//            System.out.println("Первая коллекция содержит все элементы списка");
//        } else {
//            System.out.println("Некоторые (или все) элементы из списка отсутствуют в первой коллекции");
//        }
//    }
//
//    Какой из этих коллекций понадобится меньше времени на выполнение данного метода при большом наборе данных? Почему?
//
//    ArrayList.
//    LinkedList.
//    HashSet.

//    Ответ:
//    Меньше всего времени для выполнения данного метода при большом наборе данных потребуется коллекции - HashSet.
//    В данной ситуации HashSet сумеет найти элементы быстро, за фиксированное (константное) время.


}
